code-examples/prijava-radnih-vremena-liste-poslovnih-s-elektronickim-potpisom-954-zahtjev.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:f73="http://www.apis-
it.hr/fin/2012/types/f73" xmlns:xd="http://www.w3.org/2000/09/xmldsig#"> 
<soapenv:Header/> 
<soapenv:Body> 
<f73:PrijaviRadnoVrijemeZaPoslovniceZahtjev Id="PoslProstoriId"> 
<f73:Zaglavlje> 
<f73:IdPoruke>fe17a6b8-ccfd-4f83-96dd-19683ddddd94</f73:IdPoruke> 
<f73:DatumVrijeme>05.12.2025T21:57:21</f73:DatumVrijeme> 
</f73:Zaglavlje> 
<f73:Oib>02994650199</f73:Oib> 
<f73:PoslovniProstori> 
<!-- 1 to 100 repetitions: --> 
<f73:Poslovnica> 
<f73:OznPosPr>MOJTESTPOSLZ00000001</f73:OznPosPr> 
<f73:Redovno> 
<f73:DatumOd>21.12.2025</f73:DatumOd> 
<f73:Napomena>Napomena prilikom unosa podataka za poslovnicu 
MOJTESTPOSLZ00000001</f73:Napomena> 
<f73:Jednokratno> 
<f73:DanUTjednu>1</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>2</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>3</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>4</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>5</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>6</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>7</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>8</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
</f73:Redovno> 
</f73:Poslovnica> 
<f73:Poslovnica> 
<f73:OznPosPr>MOJTESTPOSLZ00000002</f73:OznPosPr> 
<f73:Redovno> 
<f73:DatumOd>25.12.2025</f73:DatumOd> 
<f73:Napomena>Napomena prilikom unosa podataka za poslovnicu 
MOJTESTPOSLZ00000002</f73:Napomena> 
<f73:Jednokratno> 
<f73:DanUTjednu>1</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>2</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>3</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>4</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>5</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>6</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>7</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
<f73:Jednokratno> 
<f73:DanUTjednu>8</f73:DanUTjednu> 
<f73:RadnoVrijemeOd>18:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:00</f73:RadnoVrijemeDo> 
</f73:Jednokratno> 
</f73:Redovno> 
</f73:Poslovnica> 
<f73:Poslovnica> 
<f73:OznPosPr>MOJTESTPOSLZ00000003</f73:OznPosPr> 
<f73:Redovno> 
<f73:DatumOd>31.12.2025</f73:DatumOd> 
<f73:Napomena>Dodatna napomena za unos radnog vremena samo za tri 
dana</f73:Napomena> 
<f73:ParniNeparni> 
<f73:DanUTjednu>1</f73:DanUTjednu> 
<f73:ParNepar>P</f73:ParNepar> 
<f73:RadnoVrijemeOd>08:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>15:30</f73:RadnoVrijemeDo> 
</f73:ParniNeparni> 
<f73:ParniNeparni> 
<f73:DanUTjednu>1</f73:DanUTjednu> 
<f73:ParNepar>N</f73:ParNepar> 
<f73:RadnoVrijemeOd>09:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>16:30</f73:RadnoVrijemeDo> 
</f73:ParniNeparni> 
<f73:ParniNeparni> 
<f73:DanUTjednu>2</f73:DanUTjednu> 
<f73:ParNepar>P</f73:ParNepar> 
<f73:RadnoVrijemeOd>10:00</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>17:30</f73:RadnoVrijemeDo> 
</f73:ParniNeparni> 
<f73:ParniNeparni> 
<f73:DanUTjednu>2</f73:DanUTjednu> 
<f73:ParNepar>N</f73:ParNepar> 
<f73:RadnoVrijemeOd>10:15</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>17:45</f73:RadnoVrijemeDo> 
</f73:ParniNeparni> 
<f73:ParniNeparni> 
<f73:DanUTjednu>3</f73:DanUTjednu> 
<f73:ParNepar>P</f73:ParNepar> 
<f73:RadnoVrijemeOd>15:11</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:12</f73:RadnoVrijemeDo> 
</f73:ParniNeparni> 
<f73:ParniNeparni> 
<f73:DanUTjednu>3</f73:DanUTjednu> 
<f73:ParNepar>N</f73:ParNepar> 
<f73:RadnoVrijemeOd>16:18</f73:RadnoVrijemeOd> 
<f73:RadnoVrijemeDo>22:18</f73:RadnoVrijemeDo> 
</f73:ParniNeparni> 
</f73:Redovno> 
</f73:Poslovnica> 
</f73:PoslovniProstori> 
<f73:OibOper>67123497466</f73:OibOper> 
<Signature xmlns="http://www.w3.org/2000/09/xmldsig#"> 
<SignedInfo> 
<CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/> 
<SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/> 
<Reference URI="#PoslProstoriId"> 
<Transforms> 
<Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/> 
<Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/> 
</Transforms> 
<DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/> 
<DigestValue>69gSf6xDZtWBk4Cg88guSZCtXd8=</DigestValue> 
</Reference> 
</SignedInfo> 
<SignatureValue>gDyLHsnSnM7dhhD4hH3YUVOOEgjwFSZP96u9rpChpbf6kjOFrnY3sj+lyj6xwQS
ahAWTNtgW4rsa 
JU23FLDOyhHrShcexY3nxoaiOkU7HanbLE/zD4KKxO2M87MJU2GcbhE6xnE3mYLg0ZCPlzRnnJXd 
BQdufY8WGCYtlhQNQUQtUeG008MIkIdxZL/0au+UQI66yq1pGqBfuaUrmLpf1vvZkB5HCs5tq4OD 
GdVgKQDXQQiX9osuP64LjxY/99KYU8YXhUEtu44Fk2uZvWz5lp9BEtU5bpey+eFcUzb719DBLUJU 
bQQWUeQ3KlqitCyXp1hLDIYUJZuMViT31cwgGg==</SignatureValue> 
<KeyInfo> 
<X509Data> 
<X509Certificate>MIIGjzCCBHegAwIBAgIQVMN+ETtXRMMAAAAAXyRDJDANBgkqhkiG9w0BAQsFAD
BIMQswCQYDVQQG 
EwJIUjEdMBsGA1UEChMURmluYW5jaWpza2EgYWdlbmNpamExGjAYBgNVBAMTEUZpbmEgRGVtbyBD 
QSAyMDIwMB4XDTIxMTAxOTA4MjY1NloXDTI2MTAxOTA4MjY1NlowWDELMAkGA1UEBhMCSFIxJTAj 
BgNVBAoTHEFQSVMgSVQgRC5PLk8uIEhSMDI5OTQ2NTAxOTkxDzANBgNVBAcTBlpBR1JFQjERMA8G 
A1UEAxMIRklTS0FMIDMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIBAQCnVrIj9eExiFKX 
TB/t6eMBcb6IqzgmHMrJ6L5r5bUbcg7clP1OTfrOItMyUf2cVAl7B3gjS7rE1Y4LcnApYbx2Mzhf 
wi/ogmruJpdox32J8LG/1GmOW96Q9zJ/BlqLBrOBAmQ1i69QonilnbwQWi+XKqMRAqtNkJud6G44 
04kWiDgdXT6obZshJQaimG4dVd/bBxliGNKPg9nK6ZI2Ng4Vy075ajRe3bq8NseNhlCLB26UL1WS 
hkDNpGYTiN8K8Xyx7JFNpytC3ufS5PhPM8TLjJUYARrACC/CxHulWavJd4qVM/8ZYlORhJbBuc1d 
jjpyGsqVgYq5LED51jSCdV8XAgMBAAGjggJjMIICXzAOBgNVHQ8BAf8EBAMCBaAwHQYDVR0lBBYw 
FAYIKwYBBQUHAwQGCCsGAQUFBwMCMIGsBgNVHSAEgaQwgaEwgZQGCSt8iFAFIQ8DATCBhjBBBggr 
BgEFBQcCARY1aHR0cDovL2RlbW8tcGtpLmZpbmEuaHIvY3BzL2Nwc25xY2RlbW8yMDE0djItMC1o 
ci5wZGYwQQYIKwYBBQUHAgEWNWh0dHA6Ly9kZW1vLXBraS5maW5hLmhyL2Nwcy9jcHNucWNkZW1v 
MjAxNHYyLTAtZW4ucGRmMAgGBgQAj3oBATB9BggrBgEFBQcBAQRxMG8wKAYIKwYBBQUHMAGGHGh0 
dHA6Ly9kZW1vMjAxNC1vY3NwLmZpbmEuaHIwQwYIKwYBBQUHMAKGN2h0dHA6Ly9kZW1vLXBraS5m 
aW5hLmhyL2NlcnRpZmlrYXRpL2RlbW8yMDIwX3N1Yl9jYS5jZXIwgbQGA1UdHwSBrDCBqTCBpqCB 
o6CBoIYoaHR0cDovL2RlbW8tcGtpLmZpbmEuaHIvY3JsL2RlbW8yMDIwLmNybIZ0bGRhcDovL2Rl 
bW8tbGRhcC5maW5hLmhyL2NuPUZpbmElMjBEZW1vJTIwQ0ElMjAyMDIwLG89RmluYW5jaWpza2El 
MjBhZ2VuY2lqYSxjPUhSP2NlcnRpZmljYXRlUmV2b2NhdGlvbkxpc3QlM0JiaW5hcnkwHwYDVR0j 
BBgwFoAUla9S1cLp1zeEPm5Jj8kf6lwrX88wHQYDVR0OBBYEFHbh5aGV7SnN828H+8jZ/1kRMgkm 
MAkGA1UdEwQCMAAwDQYJKoZIhvcNAQELBQADggIBAGZLzwPNAnhYAESsDRLdnZ/7a7uoKLOTh0hN 
UgqESGOkB8xcuQFHHKLwQlmFdv+/2i3WPT4aXg0PNPFIlNLABIlnZEJfhpAsnswCBcZfBMTFqmOU 
lJkQIghSSVHm7yC2eJBiB9x/PnZQzd2FteHOprT5exd2wvHIhQEtmLDpI+hDNv6zvBxrRcz6aT4v 
5KfmkP5O4z1jj5y4Ug5Su7TX2KpT/zRNPPPQXsqg+dS+6C+FJFG7UFRHEMSvAc2BFDm+T8UXUIXE 
61jSOj/Dw1g2mSSdJFLNrB8T0hWaj7EX32sEd0KGQJmBsK4hMiUmV96ZmJFcJksiuwPcAbXLdvJt 
8R6T9KuVsxMBKt7QVYFd723o2hiPTCbc/2LrwAIpAIsinlOi238SyNvVqvsuRVe8EWKZo+KV9JZ9 
IQksz/vXNehGt/f4NCfGqZZiWndbp1DewISSLifqlKyGzghC49jwUu03HD86RRFYw6l6BNf0s9s2 
YyppEndTCJWruaX+YYEYxulVBY0E4hohidwWBCGg4wWKWEUYBnHuzaSTEzx6KQUZtRoxuISPGujE 
6fwb4oSExQ3FcURRszb+kwajXiptZk1kJrbF5GBYeGq74mFRth+pRaoEWWdGzz38Az6GXD+dg9Fh 
qCvj6Z5PzH80VoVso9YQVauOWavRdfIgDIxLenNx</X509Certificate> 
<X509IssuerSerial> 
<X509IssuerName>CN=Fina Demo CA 2020,O=Financijska 
agencija,C=HR</X509IssuerName> 
<X509SerialNumber>112670206482201164408252157595450884900</X509SerialNumber> 
</X509IssuerSerial> 
</X509Data> 
</KeyInfo> 
</Signature> 
</f73:PrijaviRadnoVrijemeZaPoslovniceZahtjev> 
</soapenv:Body> 
</soapenv:Envelope>